<?php

$intobus = array("08:10", "08:20", "08:25", "08:40", "08:50", "08:55", "09:10", "09:20", "09:25", "09:40", "09:50", "09:55", "10:10", "10:20", "10:25", "10:40", "10:50", "10:55", "11:20", "11:40", "11:50", "12:20", "12:40", "12:50", "13:20", "13:40", "13:50", "14:20", "14:40", "14:50", "15:20", "15:40", "15:50", "16:20", "16:40", "16:50", "17:20", "17:40", "17:50", "18:20", "19:00", "19:40", "20:20", "21:00");

$citybus = array("08:00", "08:15", "08:30", "08:45", "09:00", "09:15", "09:30", "09:45", "10:00", "10:15", "10:30", "10:45", "11:00", "11:30","12:00", "12:30", "13:00", "13:30", "14:00", "14:30",  "15:00", "15:30", "16:00", "16:30", "17:00", "17:30","18:00", "18:40",  "19:20", "20:00", "20:40");

$intoschool = array("08:15", "08:25","08:30", "08:35", "08:40", "08:45", "08:55", "09:00","09:05", "09:10", "09:15","09:25","09:30", "09:35", "09:40", "09:45" ,"09:55" ,"10:00" , "10:05", "10:10", "10:15", "10:25", "10:30", "10:35", "10:40", "10:45", "10:55", "11:00", "11:05", "11:10", "11:15", "11:35", "11:45", "11:55", "12:05", "12:15", "12:35", "12:45", "12:55", "13:05", "13:15", "13:35", "13:45", "13:55", "14:05", "14:15", "14:35", "14:45", "14:55", "15:05", "15:15", "15:35", "15:45", "15:55", "16:05", "16:15", "16:35", "16:45", "16:55", "17:05", "17:15", "17:35", "17:45", "17:55", "18:05", "18:20", "18:40", "19:00", "19:20", "19:40", "20:00", "20:15", "20:40", "21:00", "21:20");

$vacation_out = array("08:20", "09:20", "10:20", "11:20", "12:20", "13:20", "15:20", "16:20", "17:20", "18:00");
$vacation_in = array("08:45", "09:45", "10:45", "11:45", "12:45", "13:45", "15:45", "16:45", "17:45", "18:25");

$season_intobus = array("08:10", "08:20", "08:25", "08:40", "08:50", "08:55", "09:10", "09:20", "09:25", "09:40", "09:50", "09:55", "10:10", "10:20", "10:25", "10:40", "10:50", "10:55", "11:20", "11:40", "11:50", "12:20", "12:40", "12:50", "13:20", "13:40", "13:50", "14:20", "14:40", "14:50", "15:20", "15:40", "15:50", "16:20", "16:40", "16:50", "17:20", "17:40", "17:50");

$season_citybus = array("08:00", "08:15", "08:30", "08:45", "09:00", "09:15", "09:30", "09:45", "10:00", "10:15", "10:30", "10:45", "11:00", "11:30","12:00", "12:30", "13:00", "13:30", "14:00", "14:30",  "15:00", "15:30", "16:00", "16:30", "17:00", "17:30");

$season_intoschool = array("08:15", "08:25","08:30", "08:35", "08:40", "08:45", "08:55", "09:00","09:05", "09:10", "09:15","09:25","09:30", "09:35", "09:40", "09:45" ,"09:55" ,"10:00" , "10:05", "10:10", "10:15", "10:25", "10:30", "10:35", "10:40", "10:45", "10:55", "11:00", "11:05", "11:10", "11:15", "11:35", "11:45", "11:55", "12:05", "12:15", "12:35", "12:45", "12:55", "13:05", "13:15", "13:35", "13:45", "13:55", "14:05", "14:15", "14:35", "14:45", "14:55", "15:05", "15:15", "15:35", "15:45", "15:55", "16:05", "16:15", "16:35", "16:45", "16:55", "17:05", "17:15", "17:35", "17:45", "17:55", "18:05");



$shuttle = array($intobus, $citybus, $intoschool, $vacation_out, $vacation_in, $season_intobus, $season_citybus, $season_intoschool);
/* intobus : 44 ==> 2
 * citybus : 31 ==> 1
 * intoschool : 75 ==> 0
 * vacation_in : 10 ==> 1
 * vacation_out : 10 ==> 1
 * season_intobus : 39 ==> 0
 * season_citybus : 26 ==> 2
 * season_intoschool : 65 ==> 2    */

$num = array(0, 0, 0);

foreach($shuttle as $item) {
	
	if(sizeof($item)%3 == 0) {
		$head = sizeof($item)/3;
		$arr_1 = "";
		
		for($i = 0; $i < $head; $i++) {
		
			$count = $head + $i;
			$arr_1 = $arr_1.$item[$i].",".$item[$count].",".$item[sizeof($item) - (sizeof($item)/3 - $i)]."\n";
		}
		if($num[0] == 0) {
			$string_intoschool = $arr_1;

		}
		else if($num[0] == 1) {
			$string_season_intobus = $arr_1;

		}
		$num[0] = 1;
		$arr_1 = "";
	} 
	else if(sizeof($item)%3 == 1) {
		$head = intval(sizeof($item)/3);
		$arr_2 = "";

		for($i = 0; $i <= $head; $i++) {

			$count = $head + $i;
			
			if(strlen($item[sizeof($item) + 1 - ($head - $i)], 'UTF-8') != 0) {
				$arr_2 = $arr_2.$item[$i].",".$item[$count + 1].",".$item[sizeof($item) + 1 - ($head - $i)]."\n";
			}
			else if(strlen($item[sizeof($item) + 1 - ($head - $i)], 'UTF-8') == 0){
				$arr_2 = $arr_2.$item[$i].",".$item[$count + 1].$item[sizeof($item) + 1 - ($head - $i)]."\n";
			}
		}
		if($num[1] == 0) {
			$string_citybus = $arr_2;
		}
		else if($num[1] == 1) {
			$string_vacation_in = $arr_2;
		}
		else if($num[1] == 2) {
			$string_vacation_out = $arr_2;
		}
		$num[1] += 1;
		$arr_2 = "";
	}
	else if(sizeof($item)%3 == 2) {
		$head = intval(sizeof($item)/3);
		$arr_3 = "";

		for($i = 0; $i <= $head; $i++) {

			$count = $head + $i + 1;
			if(strlen($item[sizeof($item) - ($head - $i)]) != 0) 
			{
				$arr_3 = $arr_3.$item[$i].",".$item[$count].",".$item[sizeof($item) - ($head - $i)]."\n";
			}
			else if(strlen($item[sizeof($item) - ($head - $i)]) == 0) {
				$arr_3 = $arr_3.$item[$i].",".$item[$count].$item[sizeof($item) - ($head - $i)]."\n";
			}
		}
		if($num[2] == 0) {
			$string_intobus = $arr_3;
		}
		else if($num[2] == 1) {
			$string_season_citybus = $arr_3;
		}
		else if($num[2] == 2) {
			$string_season_intoschool = $arr_3;
		}
		$num[2] += 1;
		$arr_3 = "";
	}
}
 
// Modify the array order if shuttlebus time changed.
// From here, modify this code if shuttlebus time changed.
// Can Return Arrays List Here(PHP to ANDROID)

$string_season = $string_season_intobus."/".$string_season_citybus."/".$string_season_intoschool;
echo $string_season;

/* string_intobus : 학기중 진입로방향
 * string_citybus : 학기중 시내방향
 * string_intoschool : 학기중 학교방향
 * string_vacation_in : 방학중 등교
 * string_vacation_out : 방학중 하교
 * string_season_intobus : 계절학기중 진입로방향
 * string_season_citybus : 계절학기중 시내방향
 * string_season_intoschool : 계절학기중 학교방향
 */


?>
